
public class NotepadDemo {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		INotepad[] Notepads = new INotepad[3];
		Notepads[0] = new SimpleNotepad(5);
		Notepads[1] = new SecuredNotepad("123ABCabc", 5);
		Notepads[2] = new ElectronicSecuredDevice("1234ABCDabcd", 5);
		System.out.println("------------------------------SimpleNotepad---------------------------------");
		Notepads[0].addText("Изречението е граматически организирано свързване на думи, със собствено интонационно и смислово значение", "Първа страница",1);
		Notepads[0].addText("Това е най-голямата граматична единица на езика и най-малката градивна единица на текста. [2] Изречението е и основната структурна единица на текста.","Втора страница", 2);
		Notepads[0].addText("Изречението се отличава с граматическа форма, с логическо или емоционално съдържание и може да изразява мисли, чувства и волеви подбуди.", "Трета страница", 3);
		Notepads[0].addText("От пунктуационна гледна точка може да завършва на точка, въпросителен или удивителен знак, както и с многоточие.", "Четвърта страница", 4);
		Notepads[0].addText("Науката синтаксис се занимава с изследването на закономерностите, по които думите са подредени смислено в изречения.", "Пета страница", 5);
		Notepads[0].printAll();
		Notepads[0].printAllPagesWithDigits();
		Notepads[0].searchWord("грамати");
		Notepads[0].deleteText(3);
		Notepads[0].overWriteText("Ала бала ница турска паница", "НОВА СТРАНИЦА", 4);
		Notepads[0].printAll();
		System.out.println("------------------------------SecuredNotepad---------------------------------");
		Notepads[1].addText("Изречението е граматически организирано свързване на думи, със собствено интонационно и смислово значение", "Първа страница",1);
		Notepads[1].addText("Това е най-голямата граматична единица на езика и най-малката градивна единица на текста. [2] Изречението е и основната структурна единица на текста.","Втора страница", 2);
		Notepads[1].addText("Изречението се отличава с граматическа форма, с логическо или емоционално съдържание и може да изразява мисли, чувства и волеви подбуди.", "Трета страница", 3);
		Notepads[1].addText("От пунктуационна гледна точка може да завършва на точка, въпросителен или удивителен знак, както и с многоточие.", "Четвърта страница", 4);
		Notepads[1].addText("Науката синтаксис се занимава с изследването на закономерностите, по които думите са подредени смислено в изречения.", "Пета страница", 5);
		Notepads[1].printAll();
		Notepads[1].printAllPagesWithDigits();
		Notepads[1].searchWord("грамати");
		Notepads[1].deleteText(3);
		Notepads[1].overWriteText("Ала бала ница турска паница", "НОВА СТРАНИЦА", 4);
		Notepads[1].printAll();
		System.out.println("------------------------------ElectronicSecuredDevice---------------------------------");
		Notepads[2].addText("Изречението е граматически организирано свързване на думи, със собствено интонационно и смислово значение", "Първа страница",1);
		Notepads[2].addText("Това е най-голямата граматична единица на езика и най-малката градивна единица на текста. [2] Изречението е и основната структурна единица на текста.","Втора страница", 2);
		Notepads[2].addText("Изречението се отличава с граматическа форма, с логическо или емоционално съдържание и може да изразява мисли, чувства и волеви подбуди.", "Трета страница", 3);
		Notepads[2].addText("От пунктуационна гледна точка може да завършва на точка, въпросителен или удивителен знак, както и с многоточие.", "Четвърта страница", 4);
		Notepads[2].addText("Науката синтаксис се занимава с изследването на закономерностите, по които думите са подредени смислено в изречения.", "Пета страница", 5);
		Notepads[2].printAll();
		Notepads[2].printAllPagesWithDigits();
		Notepads[2].searchWord("грамати");
		Notepads[2].deleteText(3);
		((IElectronicDevice) Notepads[2]).stop();
		Notepads[2].overWriteText("Ала бала ница турска паница", "НОВА СТРАНИЦА", 4);
		Notepads[2].printAll();
	}

}
